//#include<stdio.h>
//int main() 
//{
//	/*
//	    给定整数 n = 100，获取所有小于等于 n 的质数的数量。
//	         示例：
//			       输入： n = 100
//                   输出： n = 25	
//	
//	         质数：只能被1和本身整除的数字   7  
//	      从复杂到简单
//
//		  1.判断一个整数是否是一个质数
//		  2.添加范围 1-100
//		  3.统计
//	*/
//	int countA = 0;
//	for (int i = 2; i <= 100; i++) 
//	{
//
//		//i：依次表示2-100之间每一个数字
//		//统计从2开始，到i-1，在这个范围之内，有多少个数字能被i整除
//		int count = 0;
//		for (int j = 2; j < i; j++)
//		{
//			if (i % j == 0)
//			{
//				//我找到了一个数字能被i整除
//				count++;
//				break;
//			}
//		}
//		//对count进行判断 0 
//		if (count == 0)
//		{
//			countA++;
//		}
//	}
//	printf("%d\n", countA);
//
//	
//	return 0;
//}