//#include<stdio.h>
//int main() 
//{
//	/*
//	    1的1次方 + 2的2次方 + 3的3次方 + ...+ 10的10次方，结果为多少？
//	    提示：结果过大用long long类型
//	    正确答案： 10405071317
//	
//	    分析：相当于就是10个选项相加
//	    规则：
//	
//	
//	*/
//	//定义一个变量用来累加求最后的结果
//	long long res = 0;
//
//	//外循环：依次表示1 - 10
//	for (int i = 1; i <= 10; i++) 
//	{
//		//内循环：表示外循环的数字一共要乘几次
//		//i = 1：乘1次
//		//i = 2：乘2次
//		//i = 3：乘3次
//		long long pow = 1;
//		for (int j = 1; j <= i; j++) 
//		{
//			pow = pow * i;
//		}
//		//当内循环结束后，就表示每一个单独的选项，已经有结果了
//		//累加的目的就是为了把每一个选项的结果相加
//		res = res + pow;
//	}
//	//打印
//	printf("%lld\n", res);
//	return 0;
//}